# 이 파일에 게임 스크립트를 입력합니다.

# image 문을 사용해 이미지를 정의합니다.
# image eileen happy = "eileen_happy.png"

# 게임에서 사용할 캐릭터를 정의합니다.
define e = Character('???', color="#c8ffc8")
define d = Character('슈퍼전영제해커게이는데비안기반POPOS사용자', color="#c8ffc8")
define f = Character('전영제해커게이는리눅스사용자', color="#c8ffc8")
define fd = Character('全英制黑客门是Linux用户', color="#c8ffc8")
define fo = Character('시진핑', color="#ff0000")
# 여기에서부터 게임이 시작합니다.
label start:

    "앗.. 여긴 어디지.."

    "너무 어두워...."
    
    e "눈을 떴구나."

    "누구??"

    e "눈을 떴구나.."

    scene bg hacker1

    e "아니 이양반아"

    e "성능 좋은"

    "뭐야? 이미친 해커새끼는?"

    e "아오 그냥 너같은 새끼는 있는 학교에서의 지위를 활용하여 이를 통한 상습적 비폭력적 학교폭력을 상습적으로 저지르는 놈인거지 ㅇㅇ"

    "뭐라는거야 이 미친놈은"
    
    e "내 이름은 슈퍼전영제해커게이는데비안기반POPOS사용자 라고 한다."
    
    "너무 긴거 아니야?"

    d "그럼 줄여줄게, '전영제해커게이는리눅스사용자' 어때?"

    "그래도 긴데.."

    f "어쩌라고 씨발련아 야 니 친정엄마 니 ㅉ"
    
    "이새끼는 진짜 뭐지"

    f "나는 세상을 짊어진 자이자 리눅스를 사용하여 해킹을 하여 세상을 평화롭게 만드는 해케게이영제(이하생략) 이라고 한다."

    "씨발 그래서 나는 왜 여기 있는거에요?"

    f "몰라 씨발련아"

    "미친놈인가"

    scene bg hacker2

    "그래서 여기서 뭐하고 있는거임"

    f "나도 몰라"
    
    "그럼 같이 사망에 이를만큼 많은 충격량을 받을 수 있는 장소에 가서 같이 떨어질래?"

    f "아니 이양반아"

    "왜 씨발련아"

    f "성능 좋은 내가 칼리 리눅스를 사용하여 해킹을 하는 모습은 보고 가야지"

    "알겠어요"

    f "그럼 나의 해킹맛좀 조금만 보거라"

    scene bg hacking

    fd "好好品尝吧，习近平，尝尝我的黑客攻击吧！"

    fd "尝尝我的黑客攻击吧！"

    "뭐라는거야 미친 중국인해커새끼"

    scene bg hacker3

    fo "아니씨발 뭐야"

    fo "다 정보가 털리고 있잖아"

    scene bg hacker2

    "아니씨발 뭐하는거야"

    fd "드디어 내 고용주를 엿먹였다. 나는 자유다!"
    
    fd "终于尝到了我的雇佣股。我是自由！"

    "그렇게 세계는 평화로워졌다고 한다."
    


    return
